public class Singleton {
    private static Singleton instance;

    private Singleton() {}

    public static Singleton getInstance() {
        if (instance == null) {
            instance = new Singleton();
        }
        return instance;
    }

//Шаблон Singleton призначений для того, щоб забезпечити,
// що клас має лише один екземпляр і надає глобальну точку доступу до цього екземпляра.
// У Java його реалізують, зазвичай, за допомогою приватного конструктора та статичного методу,
// який повертає той самий екземпляр об'єкта кожного разу, коли він викликається.
// Цей шаблон часто використовується для створення об'єкту, що відповідає за доступ до конфігурацій
// або ресурсів програми.
//java
}
